[
    {
        "description" : "Flat Track Roller Derby is played on a flat, oval track. Play is broken up into two 30-minute periods, and within those periods, into units of play called “Jams,” which last up to two minutes. \\n During a Jam, each team fields up to five Skaters. Four of these Skaters are called “Blockers” (together, the Blockers are called the “Pack”), and one is called a “Jammer.” The Jammer wears a helmet cover with a star on it. \\n The two Jammers start each Jam behind the Pack, and score a point for every opposing Blocker they lap, each lap. Because they start behind the Pack, they must get through the Pack, then all the way around the track to be eligible to score points on opposing Blockers.",
        "game-parameters-and-safety": {
            "timing": {
                "game-duration": "A game lasts for 60 minutes of play, divided into two 30-minute periods with a halftime between them. Periods are broken into Jams.",
                "jam-duration": "A Jam can last up to two minutes. Jams may be called off prior to two minutes as part of gameplay, as described below. Each Jam starts with a single short whistle blast, and finishes at the end of a series of four short whistle blasts. At least 30 seconds must elapse between Jams. More than 30 seconds may not elapse unless a timeout is called."
            },
            "teams": {
                "team": "A team is comprised of Skaters, who must be uniquely identified by a roster number. Each team must have a jersey of the same base color, such that uniform colors of the two teams playing are of high contrast. Roster numbers must be clearly displayed on a Skater’s back and upper arm areas. Each team must have helmet covers to clearly indicate who their Jammer and Pivot are. The Jammer and Pivot helmet covers for the two teams must be easy to differentiate.",
                "skater": "Skaters must wear quad-style roller skates and protective gear during play. Inline skates are not permitted. Protective gear may not be removed during play. Protective gear may not impair or interfere with the safety or play of other Skaters, support staff, or Officials."
            },
            "timeouts": {
                "team-timeouts": "Each team has three timeouts that they can take during the game. Team Timeouts may be requested only by the team’s Captain or Designated Alternate. Penalized Captains or Designated Alternates cannot request a Team Timeout. Team Timeouts last for 60 seconds.",
                "official-reviews": "Each team begins the period with one Official Review which they may use during that period. An Official Review is a formal request made by a team’s Captain or Designated Alternate for Officials to review a specific officiating decision. The only officiating decisions that can be the subject of an Official Review are those made during the prior Jam, or during the lineup time preceding the prior Jam. The Head Referee investigates the review with other Officials, and uses the information gathered to render a decision on the item under review, as well as related decisions. The Head Referee then announces their findings and any changes that result from the review to both teams’ representatives. This decision is final and not reviewable.",
                "official-timeouts": "Officials may take a timeout in order to ensure that the game is running smoothly and correctly. If the prior Jam ended with less than 30 seconds on the period clock, the fact that the Officials called a timeout will not necessarily result in another Jam occurring in the same manner that a Team Timeout or Official Review would. Instead, the Officials must determine whether or not there is reason to hold another Jam for that period. If the Officials determine that there is no reason to hold another Jam, both teams must be given a chance to call a Team Timeout or Official Review (if they have any remaining). If they decline, the period will end."
            },
            "game-information" : "Critical game information must be displayed in a manner that is highly visible to Teams, Officials, and spectators. This displayed critical game information is considered official, and must include, at a minimum: the period clock, Jam clock, and Official Score."
        },
        "gameplay": {
            "track": "The track must conform to the standardized dimensions of the WFTDA Track Specifications. The track must be flat, clean, and suitable for roller skating. The track must be marked by a boundary that stands in high contrast to the floor. The boundary counts as part of the track (the boundary is “in bounds”) and may not vary in width around the track.",
            "positions" : {
                "definition": "For each Jam, a team must field one Jammer, and at most four Blockers. One of these Blockers may be designated as the Pivot Blocker. Any Skaters who are not completely on the track at the Jam-Starting Whistle may not participate in the Jam, and thus do not count toward these limits. Skaters serving penalties (in, or on their way to, the Penalty Box) are counted toward these limits. Teams must field at least one Blocker who is not serving a penalty. Skaters may not change positions during a Jam, except in the case of a Star Pass.",
                "jammer": "The Jammer is denoted as the Skater in visible possession of the Jammer helmet cover (a.k.a. the Star) at the beginning of the Jam. If a Skater is serving a penalty as their team’s Jammer, no teammate may begin the Jam in possession of the Star or behind the Jammer Line. If there is neither a Skater serving a penalty as the Jammer nor a Skater with a visible Star, then the team has failed to field a Jammer for the upcoming Jam and will be penalized accordingly. Unless they are serving a penalty, the Jammer must start the Jam on or behind the Jammer Line. Jammers may be stopped or coasting, but may not be actively gaining speed in the counterclockwise direction at the Jam-Starting Whistle.",
                "lead-jammer": "The Lead Jammer is the first Jammer who establishes superior position to the foremost in-play Blocker, having already earned a pass on all Blockers excluding those ahead of the Engagement Zone. When one Jammer is determined to be the Lead Jammer, this is indicated by two short whistle blasts. A Jammer becomes ineligible to earn Lead during a Jam if they commit a penalty during that Jam, exit the front of the Engagement Zone without having earned Lead on their initial trip, remove their helmet cover, or have their helmet cover removed by a teammate. If both Jammers qualify for Lead at the same moment (for example, the foremost Blocker goes out of play), the foremost Jammer at that moment will be declared Lead. Only Skaters who begin the Jam as Jammers may become Lead (so a Pivot who receives the Star cannot become Lead).",
                "pivot-blocker": "The Pivot is a Blocker, and is denoted as the Skater in possession of the Pivot helmet cover (a.k.a. the Stripe) at the Jam-Starting Whistle. The Pivot wearing the Stripe with the stripe showing has several additional abilities that other Blockers do not.",
                "star-pass": "A team’s Jammer may transfer their position to their team’s Pivot by successfully completing a legal Star Pass. A legal Star Pass requires the Jammer to hand the Star to their team’s Pivot while both Skaters are upright, in bounds, and in play; and while neither Skater is en route to, or in queue for, the Penalty Box. Upon releasing the Star into the Pivot’s grasp, the position of Jammer is transferred to the Pivot. The new Jammer takes over for the previous Jammer in terms of points scored, trips through the Pack, and Skaters passed. The previous Jammer becomes a Non-Pivot Blocker.",
                "blockers": "All non-jammer Skaters are considered Blockers. Non-Pivot Blockers may not wear helmet covers or have any markings on their helmets that could be confused for the Stripe or the Star."
            },
            "engagement-zome-and-pack": "The Pack is the largest group of in bounds and upright Blockers in proximity and containing members from both teams.",
            "blocks-and-assists": {
                "blocking": "Blocking refers to any physical contact made to an opponent, and to any movement or placement of one’s body to impede said opponent’s speed or movement, during a Jam, whether or not contact is made.",
                "target-zones": "It is only legal to initiate a block to an opponent’s chest, front and sides of the torso, arms, hands, hips, and the front and sides of the legs above mid-thigh.",
                "blocking-zones": "It is only legal to initiate a block using one’s torso, arms above the elbow, and legs above mid-thigh."
            },
            "passing": {
                "definition": "Skaters gain superior position on other Skaters by passing them in the counterclockwise direction.",
                "jammers": "Jammers only “earn” a pass if the pass occurs while the Jammer is wearing the Star on their helmet with the stars showing."
            }
        },
        "scoring": {
            "earning-points": "Jammers score one point every time they lap an opposing Blocker.",
            "scoring-avoidance": "Opponents can only avoid being scored upon by remaining ahead of the Jammer, or by ensuring that when they are passed, the pass is not earned.",
            "penalized-jammers": "When a Jammer is penalized, they are considered to no longer be on the track (even if they are physically still on the track)."
        },
        "penalties": {
            "definition": "When a Skater commits a rule infraction or a foul, a penalty may be assessed as a punishment, handicap, or loss of advantage.",
            "contact-penalties": {
                "definition": "Gaining position on an opponent, or causing an opponent to lose position to another teammate, due to illegal contact is always considered to have sufficient impact on the game.",
                "star-passes": "Star Passes can only be blocked by legal means. Skaters who prevent a Star Pass using illegal contact should be penalized."
            },
            "illegal-target-zone": ["Back of the body", "Head, down to the collarbone", "Below mid-thigh"],
            "presenting-target-zone": "A Skater suddenly presenting an Illegal Target Zone to an opponent, giving that opponent no reasonable opportunity to avoid illegal contact, is considered to be initiating with that target zone.",
            "impact-with-illegal-blocking-zone": "Making contact with an Illegal Blocking Zone should be penalized based on the impact it has on the target",
            "other-illegal-contact": "Initiating a block is legal when a Skater is moving counterclockwise, in play, upright, and in bounds during a Jam using Legal Contact Zones.",
            "multiplayer-blocks": "Skaters may not form a wall by linking with or grasping a teammate, or otherwise forming an impenetrable connection.",
            "game-structure-penalties": {
                "definition": "When the basic rules of the game are violated in a manner that would give a team an advantage, the individual or team who violates the rule should be penalized.",
                "illegal-positioning": "Since all Blockers are unable to block when a Pack cannot be defined, if a Skater’s illegal action destroys the Pack, or if a Skater’s actions prevent or delay the reformation of a Pack, that Skater should be penalized. Additionally, It is illegal to adopt or maintain a position in which one cannot be blocked.",
                "gaining-position": {
                    "definition": "It is illegal for a Skater to use the out-of-bounds area to gain position on someone who is upright and in bounds.",
                    "return-to-action": "If a Skater is put out of bounds due to an opponent’s block, the Skater must return in bounds behind that opponent, even if the Skater was in front of the opponent before being blocked."
                },
                "interfering-with-game": "All efforts should be made by teams and Officials to ensure that the period clock runs according to the rules of the game, and that Jams start and end as specified in the rules.",
                "other-illegal-procedures": "Skaters who violate the rules of the game should be penalized if the violation has a significant impact on the game."
            },
            "misconduct": "Misconduct can take many forms and does not have to be intentional to be considered unsporting.",
            "enforcing-penalties": {
                "definition": "Upon completion of the correct verbal cue and hand signal from an Official, the penalized Skater must immediately leave the track.",
                "penalty-enforcement-blocker": {
                    "definition": "No more than two Blockers for the same team may sit in the Penalty Box at the same time.",
                    "seat-unavailable": "A Blocker in queue may return to the Penalty Box when there is space in the Penalty Box, unless doing so would destroy the Pack."
                },
                "penalty-enforcement-jammer": "A Jammer may have their penalty time shortened if the other Jammer also receives a penalty."
            },
            "fouling-out-expulsions": {
                "fouling-out": "When seven penalties are recorded for a Skater, that Skater fouls out of the game.",
                "expulsion": "Expulsions are a way to penalize a Skater or Team Staff who has committed an act that is sufficiently dangerous or unsporting as to remove the individual from the game for that action alone."
            }
        },
        "Officiating": {
            "distinction": "Referees are responsible for assessing and enforcing penalties, must be on skates, and must be uniformed in a manner that clearly identifies them as Referees. ",
            "requirements": "Each game must also staff enough Officials to effectively track the state of the game such that the rules can be enforced in real time.",
            "duties": "All Officials are responsible for keeping the game running safely and smoothly by ensuring that the rules of the game are followed.",
            "skater-official-communication": "Officials should provide any information necessary for a Skater to know whether they are in play, including the location of the Pack. If an Official provides erroneous information to a Skater, the Skater will not be penalized for actions taken based on that information."
        },
        "gear": {
            "basic": ["mouthguard", "elbow pads", "wrist guards", "knee pads", "quad skates", "helmet"],
            "advanced": ["cushions", "plates", "wheels"]
        }
    }
]